---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.SolidBlend
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.SolidBlend

Creates a solid 3D shape that changes along its length, blending from a starting shape to an ending shape.